<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"08fd77b9d600569474012e4d3390a89b83b20f6f499e5eb72f94bbae476341fb","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1139 at https://github.com/cal-itp/data-infra/actions/runs/19977333788","plan_out_hash":"16a6d55ae839132c59d65f3ec9f39e8ac726536cb7a9daf1b7a52479528bace0","plan_hash":"98b243b22f8490eb99bd77870fd69b7acb59416fd8c4fb4a5926c31aa35e809e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "jEUqnA==" -> (known after apply)
!~      detect_md5hash      = "ZYTkUmeUMtIvs1blYkKWpw==" -> "different hash"
!~      generation          = 1764958876400985 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ZYTkUmeUMtIvs1blYkKWpw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "PDdTLA==" -> (known after apply)
!~      detect_md5hash      = "daih3OC0YlIxraoHhCaV1g==" -> "different hash"
!~      generation          = 1764958877888377 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "daih3OC0YlIxraoHhCaV1g==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1139](https://github.com/cal-itp/data-infra/actions/runs/19977333788)